/**
 * @name 心法模块-明尊琉璃体
 * 50级数据与伤害公式来源：Generator
 */
import type { 心法配置类型 } from '@/心法模块/interface'
import 默认数据 from './默认数据'
import 奇穴数据 from './奇穴'
import 技能系数, { 技能增益 } from './技能系数'
import 计算循环 from './计算循环'

export * from './计算'

const 心法配置: 心法配置类型 = {
  名称: '明尊琉璃体',
  简写: 'mzllt',
  模块负责人: '秋名山车神 九幽',
  数据提供: '考拉 唐宋',
  测试人员: '秋名山车神 九幽',
  所属门派: '明教',
  主属性: '体质',
  功法: '内功',
  伤害属性: '阳性',
  基础属性: {
    力道: 17,
    元气: 17,
    根骨: 18,
    身法: 18,
    体质: 18,
    基础气血上限: 4136,
  },
  主属性额外加成: {},
  基础气血加成: 51,
  默认数据,
  奇穴数据,
  技能系数,
  技能增益,
  计算循环,
  基础GCD: 1,
  性能功能关闭数组: ['优化算法', '一键附魔', '加速规划'],
  系统配置: {
    主题色: '#a67541',
    心法图标: 'https://img.jx3box.com/image/xf/10243.png',
    背景图: [],
  },
}

export default 心法配置
